23-01-2021_19-47-44
Model: "sequential_70"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_135 (Conv2D)          (None, 240, 240, 64)      4864      
_________________________________________________________________
max_pooling2d_135 (MaxPoolin (None, 120, 120, 64)      0         
_________________________________________________________________
flatten_61 (Flatten)         (None, 921600)            0         
_________________________________________________________________
dense_122 (Dense)            (None, 256)               235929856 
_________________________________________________________________
dense_123 (Dense)            (None, 3)                 771       
=================================================================
Total params: 235,935,491
Trainable params: 235,935,491
Non-trainable params: 0
_________________________________________________________________

Accuracy: 0.919
                 precision    recall  f1-score   support

       COVID-19      0.253     0.251     0.252       223
         NORMAL      0.319     0.333     0.326       258
Viral Pneumonia      0.350     0.338     0.344       284

       accuracy                          0.311       765
      macro avg      0.307     0.307     0.307       765
   weighted avg      0.311     0.311     0.311       765



23-01-2021_17-05-54
Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 242, 242, 64)      1792      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 121, 121, 64)      0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 937024)            0         
_________________________________________________________________
dense_2 (Dense)              (None, 256)               239878400 
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 771       
=================================================================
Total params: 239,880,963
Trainable params: 239,880,963
Non-trainable params: 0
_________________________________________________________________

Accuracy: 0.9255
                 precision    recall  f1-score   support

       COVID-19      0.314     0.318     0.316       223
         NORMAL      0.347     0.368     0.357       258
Viral Pneumonia      0.340     0.317     0.328       284

       accuracy                          0.335       765
      macro avg      0.333     0.335     0.334       765
   weighted avg      0.335     0.335     0.334       765


23-01-2021_17-30-06
Model: "sequential_11"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_17 (Conv2D)           (None, 242, 242, 128)     3584      
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 121, 121, 128)     0         
_________________________________________________________________
flatten_9 (Flatten)          (None, 1874048)           0         
_________________________________________________________________
dense_18 (Dense)             (None, 256)               479756544 
_________________________________________________________________
dense_19 (Dense)             (None, 3)                 771       
=================================================================
Total params: 479,760,899
Trainable params: 479,760,899
Non-trainable params: 0
_________________________________________________________________

Accuracy: 0.8941
                 precision    recall  f1-score   support

       COVID-19      0.283     0.300     0.291       223
         NORMAL      0.388     0.329     0.356       258
Viral Pneumonia      0.388     0.423     0.405       284

       accuracy                          0.356       765
      macro avg      0.353     0.351     0.351       765
   weighted avg      0.357     0.356     0.355       765


23-01-2021_17-44-28
Model: "sequential_20"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_33 (Conv2D)           (None, 242, 242, 128)     3584      
_________________________________________________________________
max_pooling2d_33 (MaxPooling (None, 121, 121, 128)     0         
_________________________________________________________________
conv2d_34 (Conv2D)           (None, 119, 119, 64)      73792     
_________________________________________________________________
max_pooling2d_34 (MaxPooling (None, 59, 59, 64)        0         
_________________________________________________________________
conv2d_35 (Conv2D)           (None, 57, 57, 32)        18464     
_________________________________________________________________
max_pooling2d_35 (MaxPooling (None, 28, 28, 32)        0         
_________________________________________________________________
flatten_17 (Flatten)         (None, 25088)             0         
_________________________________________________________________
dense_34 (Dense)             (None, 256)               6422784   
_________________________________________________________________
dense_35 (Dense)             (None, 3)                 771       
=================================================================
Total params: 6,519,395
Trainable params: 6,519,395
Non-trainable params: 0
_________________________________________________________________

Accuracy: 0.898
                 precision    recall  f1-score   support

       COVID-19      0.251     0.256     0.253       223
         NORMAL      0.308     0.283     0.295       258
Viral Pneumonia      0.372     0.394     0.383       284

       accuracy                          0.316       765
      macro avg      0.310     0.311     0.310       765
   weighted avg      0.315     0.316     0.315       765


23-01-2021_17-58-18
Model: "sequential_30"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_10 (Batc (None, 244, 244, 3)       12        
_________________________________________________________________
conv2d_54 (Conv2D)           (None, 242, 242, 32)      896       
_________________________________________________________________
max_pooling2d_54 (MaxPooling (None, 121, 121, 32)      0         
_________________________________________________________________
conv2d_55 (Conv2D)           (None, 119, 119, 64)      18496     
_________________________________________________________________
max_pooling2d_55 (MaxPooling (None, 59, 59, 64)        0         
_________________________________________________________________
dropout_18 (Dropout)         (None, 59, 59, 64)        0         
_________________________________________________________________
conv2d_56 (Conv2D)           (None, 57, 57, 128)       73856     
_________________________________________________________________
max_pooling2d_56 (MaxPooling (None, 28, 28, 128)       0         
_________________________________________________________________
dropout_19 (Dropout)         (None, 28, 28, 128)       0         
_________________________________________________________________
flatten_26 (Flatten)         (None, 100352)            0         
_________________________________________________________________
dense_52 (Dense)             (None, 256)               25690368  
_________________________________________________________________
dropout_20 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_53 (Dense)             (None, 3)                 771       
=================================================================
Total params: 25,784,399
Trainable params: 25,784,393
Non-trainable params: 6
_________________________________________________________________

Accuracy: 0.9542
                 precision    recall  f1-score   support

       COVID-19      0.221     0.220     0.220       223
         NORMAL      0.337     0.357     0.347       258
Viral Pneumonia      0.378     0.359     0.368       284

       accuracy                          0.318       765
      macro avg      0.312     0.312     0.312       765
   weighted avg      0.318     0.318     0.318       765


23-01-2021_18-14-19
Model: "sequential_38"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_13 (Batc (None, 244, 244, 3)       12        
_________________________________________________________________
conv2d_69 (Conv2D)           (None, 242, 242, 32)      896       
_________________________________________________________________
max_pooling2d_69 (MaxPooling (None, 121, 121, 32)      0         
_________________________________________________________________
conv2d_70 (Conv2D)           (None, 119, 119, 64)      18496     
_________________________________________________________________
max_pooling2d_70 (MaxPooling (None, 59, 59, 64)        0         
_________________________________________________________________
conv2d_71 (Conv2D)           (None, 57, 57, 128)       73856     
_________________________________________________________________
max_pooling2d_71 (MaxPooling (None, 28, 28, 128)       0         
_________________________________________________________________
flatten_33 (Flatten)         (None, 100352)            0         
_________________________________________________________________
dense_66 (Dense)             (None, 256)               25690368  
_________________________________________________________________
dense_67 (Dense)             (None, 3)                 771       
=================================================================
Total params: 25,784,399
Trainable params: 25,784,393
Non-trainable params: 6
_________________________________________________________________

Accuracy: 0.932
                 precision    recall  f1-score   support

       COVID-19      0.263     0.251     0.257       223
         NORMAL      0.325     0.314     0.320       258
Viral Pneumonia      0.366     0.391     0.378       284

       accuracy                          0.324       765
      macro avg      0.318     0.319     0.318       765
   weighted avg      0.322     0.324     0.323       765


23-01-2021_18-29-43
Model: "sequential_48"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_18 (Batc (None, 244, 244, 3)       12        
_________________________________________________________________
conv2d_90 (Conv2D)           (None, 242, 242, 32)      896       
_________________________________________________________________
max_pooling2d_90 (MaxPooling (None, 121, 121, 32)      0         
_________________________________________________________________
conv2d_91 (Conv2D)           (None, 119, 119, 64)      18496     
_________________________________________________________________
max_pooling2d_91 (MaxPooling (None, 59, 59, 64)        0         
_________________________________________________________________
dropout_30 (Dropout)         (None, 59, 59, 64)        0         
_________________________________________________________________
conv2d_92 (Conv2D)           (None, 57, 57, 128)       73856     
_________________________________________________________________
max_pooling2d_92 (MaxPooling (None, 28, 28, 128)       0         
_________________________________________________________________
dropout_31 (Dropout)         (None, 28, 28, 128)       0         
_________________________________________________________________
flatten_42 (Flatten)         (None, 100352)            0         
_________________________________________________________________
dense_84 (Dense)             (None, 256)               25690368  
_________________________________________________________________
dropout_32 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_85 (Dense)             (None, 3)                 771       
=================================================================
Total params: 25,784,399
Trainable params: 25,784,393
Non-trainable params: 6
_________________________________________________________________

Accuracy: 0.949
                 precision    recall  f1-score   support

       COVID-19      0.256     0.256     0.256       223
         NORMAL      0.358     0.357     0.357       258
Viral Pneumonia      0.358     0.359     0.359       284

       accuracy                          0.328       765
      macro avg      0.324     0.324     0.324       765
   weighted avg      0.328     0.328     0.328       765


23-01-2021_19-00-35
Model: "sequential_58"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
sequential_50 (Sequential)   (None, 244, 244, 3)       0         
_________________________________________________________________
batch_normalization_23 (Batc (None, 244, 244, 3)       12        
_________________________________________________________________
conv2d_111 (Conv2D)          (None, 242, 242, 32)      896       
_________________________________________________________________
max_pooling2d_111 (MaxPoolin (None, 121, 121, 32)      0         
_________________________________________________________________
conv2d_112 (Conv2D)          (None, 119, 119, 64)      18496     
_________________________________________________________________
max_pooling2d_112 (MaxPoolin (None, 59, 59, 64)        0         
_________________________________________________________________
dropout_39 (Dropout)         (None, 59, 59, 64)        0         
_________________________________________________________________
conv2d_113 (Conv2D)          (None, 57, 57, 128)       73856     
_________________________________________________________________
max_pooling2d_113 (MaxPoolin (None, 28, 28, 128)       0         
_________________________________________________________________
dropout_40 (Dropout)         (None, 28, 28, 128)       0         
_________________________________________________________________
flatten_51 (Flatten)         (None, 100352)            0         
_________________________________________________________________
dense_102 (Dense)            (None, 256)               25690368  
_________________________________________________________________
dropout_41 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_103 (Dense)            (None, 3)                 771       
=================================================================
Total params: 25,784,399
Trainable params: 25,784,393
Non-trainable params: 6
_________________________________________________________________

Accuracy: 0.9477
                 precision    recall  f1-score   support

       COVID-19      0.283     0.287     0.285       223
         NORMAL      0.336     0.357     0.346       258
Viral Pneumonia      0.332     0.310     0.321       284

       accuracy                          0.319       765
      macro avg      0.317     0.318     0.317       765
   weighted avg      0.319     0.319     0.319       765


23-01-2021_19-26-01
Model: "sequential_68"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
sequential_59 (Sequential)   (None, 244, 244, 3)       0         
_________________________________________________________________
batch_normalization_28 (Batc (None, 244, 244, 3)       12        
_________________________________________________________________
conv2d_132 (Conv2D)          (None, 242, 242, 32)      896       
_________________________________________________________________
max_pooling2d_132 (MaxPoolin (None, 121, 121, 32)      0         
_________________________________________________________________
conv2d_133 (Conv2D)          (None, 119, 119, 64)      18496     
_________________________________________________________________
max_pooling2d_133 (MaxPoolin (None, 59, 59, 64)        0         
_________________________________________________________________
dropout_48 (Dropout)         (None, 59, 59, 64)        0         
_________________________________________________________________
conv2d_134 (Conv2D)          (None, 57, 57, 128)       73856     
_________________________________________________________________
max_pooling2d_134 (MaxPoolin (None, 28, 28, 128)       0         
_________________________________________________________________
dropout_49 (Dropout)         (None, 28, 28, 128)       0         
_________________________________________________________________
flatten_60 (Flatten)         (None, 100352)            0         
_________________________________________________________________
dense_120 (Dense)            (None, 256)               25690368  
_________________________________________________________________
dropout_50 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_121 (Dense)            (None, 3)                 771       
=================================================================
Total params: 25,784,399
Trainable params: 25,784,393
Non-trainable params: 6
_________________________________________________________________

Accuracy: 0.9542
                 precision    recall  f1-score   support

       COVID-19      0.350     0.345     0.348       223
         NORMAL      0.360     0.368     0.364       258
Viral Pneumonia      0.381     0.377     0.379       284

       accuracy                          0.365       765
      macro avg      0.364     0.363     0.363       765
   weighted avg      0.365     0.365     0.365       765


